export const state = {
    login: false,
    salts: [
      {
        img:'/salts/2.png',
        name: 'Соль «морская» природная для ванн йодобромная',
        sostav:'соль морская природная с микроэлементами, йодобром.',
        slovo:'Йодобром',
        text:' снимает нервное напряжение, расслабляет мышцы, улучшает кровообращение, стимулирует работу щитовидной железы и гипофиза.',
      },
      {
        img:'/salts/1.png',
        name: 'Соль «морская» природная для ванн с экстрактом иланг-иланг',
        sostav:'соль морская природная с микроэлементами, экстракт иланг-иланг, парфюмерная композиция.',
        slovo:'Иланг-иланг',
        text:' глубоко расслабляет, эффективен при депрессивных состояниях, бессоннице, снимает нервное напряжение, нормализует повышенное артериальное давление и менструальный цикл.',
      },
      {
        img:'/salts/3.png',
        name: 'Соль «морская» природная для ванн с натуральным экстрактом лимона',
        sostav:'соль морская природная с микроэлементами, натуральный экстракт лимона, парфюмерная композиция.',
        slovo:'Лимон',
        text:' укрепляет иммунитет, способствует выведению шлаков, снижению веса, обладает антицеллюлитным действием.',
      },
      {
        img:'/salts/4.png',
        name: 'Соль «морская» природная для ванн с натуральным экстрактом чайного дерева',
        sostav:'соль морская природная с микроэлементами, натуральный экстракт чайного дерева, парфюмерная композиция.',
        slovo:'Чайное дерево',
        text:' оказывает противовоспалительное и болеутоляющее действие, уменьшает аллергические реакции, снимает нервное напряжение, является эффективным противовирусным и противогрибковым средством. Помогает при умственной усталости.',
      },
      {
        img:'/salts/5.png',
        name: 'Соль «морская» природная для ванн с натуральным экстрактом эквалипта',
        sostav:'соль морская природная с микроэлементами, натуральный экстракт эвкалипта, парфюмерная композиция.',
        slovo:'Эвкалипт',
        text:' - мощный антисептик, помогает быстро восстановиться после стресса, болезней, улучшает концентрацию внимания.',
      },
      {
        img:'/salts/6.png',
        name: 'Соль «морская» природная для ванн с микроэлементами',
        sostav:'соль морская природная с микроэлементами.',
        slovo:'Морская соль',
        text:' используется как успокаивающее средство при стрессовых состояниях, для поднятия эмоционального фона, настроения, работоспособности.',
      },
      {
        img:'/salts/7.png',
        name: 'Соль «морская» природная для ванн с натуральным экстрактом валерианы',
        sostav:'морская соль, экстракт валерианы.',
        slovo:'Экстрактом валерианы',
        text:' освежает тело, снимает усталость, благотворно влияет на кожу, делает ее упругой и эластичной. Экстракт валерианы, входящий в состав соли, обладает успокаивающим и расслабляющим действием.',
      },
      {
        img:'/salts/8.png',
        name: 'Соль «морская» природная для ванн с натуральным экстрактом конского каштана',
        sostav:'соль морская природная с микроэлементами, натуральный экстракт конского каштана.',
        slovo:'Конский каштан',
        text:' улучшает микроциркуляцию, укрепляет стенки капилляров и вен, рассасывает подкожные кровоизлияния, предупреждает развитие тромбов в сосудах ног.',
      },
      {
        img:'/salts/9.png',
        name: 'Соль «морская» природная для ванн с натуральным экстрактом лаванды',
        sostav:'соль морская природная с микроэлементами, натуральный экстракт лаванды, парфюмерная композиция.',
        slovo:'Лаванда',
        text:' расслабляет, снимает усталость и перевозбуждение, улучшает сон, обладает омолаживающим эффектом.',
      },
      {
        img:'/salts/10.png',
        name: 'Соль «морская» природная для ванн с экстрактом ромашки',
        sostav:'соль морская природная с микроэлементами, натуральный экстракт ромашки.',
        slovo:'Ромашка',
        text:' уменьшает раздражение, обладает антибактериальным действием (очищает мелкие трещины и препятствует началу воспаления), успокаивает кожу и оказывает противоаллергическое действие.',
      },
      {
        img:'/salts/11.png',
        name: 'Соль «морская» природная для ванн с натуральным экстрактом хвои',
        sostav:'соль морская природная с микроэлементами, натуральный экстракт хвои.',
        slovo:'Хвоя',
        text:' оказывает противовоспалительное, противовирусное действие, уменьшает отечность, снимает напряжение, оказывает общий успокаивающий и тонизирующий эффект, улучшает сон.',
      }
    ],
    brikets:[
      {
        img:'/brikets/briket1.png',
        name:'Соляной брикет с сильвинитом. Вариант 1',
        sostav:'соль морская природная с сильвинитом',
        prim:'Применение:',
        prim1:'для укладки стен. На 1м² - 50шт. брикетов',
        price:'4.00 BYN (130 RUB)',
      },
      {
        img:'/brikets/briket2.png',
        name:'Соляной брикет с сильвинитом. Вариант 2',
        sostav:'соль морская природная с сильвинитом',
        prim:'Применение:',
        prim1:'для укладки стен. На 1м² - 50шт. брикетов',
        price:'4.00 BYN (130 RUB)',
      },
      {
        img:'/brikets/briket3.png',
        name:'Соляной брикет с сильвинитом. Вариант 3',
        sostav:'соль морская природная с сильвинитом',
        prim:'Применение:',
        prim1:'для укладки стен. На 1м² - 50шт. брикетов',
        price:'4.00 BYN (130 RUB)',
      },
      {
        img:'/brikets/briket4.png',
        name:'Соляной брикет с сильвинитом. Вариант 4',
        sostav:'соль морская природная с сильвинитом',
        prim:'Применение:',
        prim1:'для укладки стен. На 1м² - 50шт. брикетов',
        price:'4.00 BYN (130 RUB)',
      },
      {
        img:'/brikets/briket5.png',
        name:'Соляной брикет',
        sostav:'соль морская природная природная',
        prim:'Применение:',
        prim1:'для укладки стен. На 1м² - 50шт. брикетов',
        price:'3.50 BYN (100 RUB)',
      },
      {
        img:'/brikets/briket5.png',
        name:'Соляной брикет с эфирным маслом',
        sostav:'соль морская природная, эфирное масло',
        price:'5.00 BYN (180 RUB)',
      },
    ],
    lamps:[
      {
        img1:'/lamps/lampBig1.png',
        img2:'/lamps/lampBig2.png',
        name:'Лампа солевая большая. Вариант 1', 
      },
      {
        img1:'/lamps/lamp3.png',
        img2:'/lamps/lamp3_1.png',
        name:'Лампа солевая большая. Вариант 2', 
      },
      {
        img1:'/lamps/lampLittle1.png',
        img2:'/lamps/lampLittle2.png',
        name:'Лампа солевая маленькая', 
      }
    ],
    preimuzh:[
      {
        icon:'/about/icon1.png',
        text:'Цех по производству солей и соляных брикетов расположен в собственном здании площадью 260 м.кв.',
      },
      {
        icon:'/about/icon2.png',
        text:'Более 10 лет работы',
      },
      {
        icon:'/about/icon3.png',
        text:'Положительные отзывы работников медицины и пациентов',
      },
      {
        icon:'/about/icon4.png',
        text:'Доставка по Беларуси производится транспортом предприятия',
      },
    ]
  }

export const mutations = {
  setSalts(state,salts){
    state.salts=salts;
  }
}

export const getters = {
    isMobile () {
        var name=$nuxt.$vuetify.breakpoint.name;
        return name=='xs' || name=='sm' ;
    },
    getSalts(state){
        return state.salts;
    },
    getBrikets(state){
      return state.brikets;
    },
    getLamps(state){
      return state.lamps;
    },
    getPreimuzh(state){
      return state.preimuzh;
    },
    height(){
        return $nuxt.$vuetify.breakpoint.height;
    }
}
